## Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
etiketler = ['a','b','c']
liste = [10, 20, 30]

In [4]:
arr = np.array(liste)

In [5]:
arr

array([10, 20, 30])

In [6]:
{'a':10,'b':20,'c':30}

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(liste)

0    10
1    20
2    30
dtype: int64

In [8]:
np.array(liste)

array([10, 20, 30])

In [9]:
pd.Series(data=liste, index=etiketler)

a    10
b    20
c    30
dtype: int64

In [10]:
seri = pd.Series(data=liste, index=etiketler)

In [11]:
type(seri)

pandas.core.series.Series

In [14]:
seri['b']

20

In [19]:
seri_2 = pd.Series(data=[1,2,3,4],index=["TR","USA","UK","JP"])

In [21]:
df = pd.DataFrame(np.random.randn(5,3), index="A B C D E".split(),columns="X Y Z".split())

In [22]:
df

          X         Y         Z
A  0.941360 -0.824575 -0.015474
B  1.217472 -0.440843 -1.196477
C -0.504563  0.526513 -1.706850
D -1.459681  0.142295 -2.389207
E  0.245973 -1.263148 -1.474683

In [26]:
df[["X","Z","Y"]]

          X         Z         Y
A  0.941360 -0.015474 -0.824575
B  1.217472 -1.196477 -0.440843
C -0.504563 -1.706850  0.526513
D -1.459681 -2.389207  0.142295
E  0.245973 -1.474683 -1.263148

In [27]:
df.X

A    0.941360
B    1.217472
C   -0.504563
D   -1.459681
E    0.245973
Name: X, dtype: float64

In [28]:
type(df["X"])

pandas.core.series.Series

In [29]:
#yeni kolon: 2X+Z-3Y
df["YENI"]=2*df["X"]+df["Z"]-3*df["Y"]

In [30]:
df

          X         Y         Z      YENI
A  0.941360 -0.824575 -0.015474  4.340970
B  1.217472 -0.440843 -1.196477  2.560997
C -0.504563  0.526513 -1.706850 -4.295517
D -1.459681  0.142295 -2.389207 -5.735456
E  0.245973 -1.263148 -1.474683  2.806708

In [34]:
df.drop("Z",axis=1,inplace=True)

In [35]:
df

          X         Y      YENI
A  0.941360 -0.824575  4.340970
B  1.217472 -0.440843  2.560997
C -0.504563  0.526513 -4.295517
D -1.459681  0.142295 -5.735456
E  0.245973 -1.263148  2.806708

In [38]:
df.drop("D",inplace=True)

In [39]:
df

          X         Y      YENI
A  0.941360 -0.824575  4.340970
B  1.217472 -0.440843  2.560997
C -0.504563  0.526513 -4.295517
E  0.245973 -1.263148  2.806708

In [42]:
# Data frame satır seçimi
df.loc["A"]

pandas.core.series.Series

In [44]:
df.iloc[0]

X       0.941360
Y      -0.824575
YENI    4.340970
Name: A, dtype: float64

In [46]:
df[["X","Y"]]

          X         Y
A  0.941360 -0.824575
B  1.217472 -0.440843
C -0.504563  0.526513
E  0.245973 -1.263148

In [47]:
df.loc[["B","C"]]

          X         Y      YENI
B  1.217472 -0.440843  2.560997
C -0.504563  0.526513 -4.295517

In [49]:
df.loc[["B","C"],["X","Y"]]

          X         Y
B  1.217472 -0.440843
C -0.504563  0.526513